Revit 2024 API
IdlingEventArgs Class
 The event arguments used by the Idling event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class IdlingEventArgs : RevitAPIPreEventArgs
Visual Basic
Public Class IdlingEventArgs _
	Inherits RevitAPIPreEventArgs
Visual C++
public ref class IdlingEventArgs : public RevitAPIPreEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.IdlingEventArgs
See Also
IdlingEventArgs Members
Autodesk.Revit.UI.Events Namespace